system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1      ;

L4  	10	   ; // L*4
B3  	8.152  ; // S/2 + B/2 + L*3
T   	0.133  ; // T
T3d 	0.0931 ; // T - 0.3 T
T2u 	0.1729 ; // T + 0.3 T
T4  	0.532  ; // 4T
T6  	0.798  ; // 6T
L3  	7.5	   ; // 3L
bot 	5	   ; // 2L
top  	2.5    ; // 1L


vertices
(
    (-$L4  -$B3    -$bot)  
    ( $L3  -$B3    -$bot) 
    ( $L3     0    -$bot) 
    (-$L4     0    -$bot) 

    (-$L4  -$B3   -$T4)
    ( $L3  -$B3   -$T4)
    ( $L3    0    -$T4)
    (-$L4    0    -$T4)

    (-$L4  -$B3   $T3d)
    ( $L3  -$B3   $T3d)
    ( $L3    0    $T3d)
    (-$L4    0    $T3d)

    (-$L4  -$B3   $T)
    ( $L3  -$B3   $T)
    ( $L3     0   $T)
    (-$L4     0   $T)

    (-$L4  -$B3   $T2u)
    ( $L3  -$B3   $T2u)
    ( $L3     0   $T2u)
    (-$L4     0   $T2u)

    (-$L4  -$B3   $T6)
    ( $L3  -$B3   $T6)
    ( $L3     0   $T6)
    (-$L4     0   $T6)

    (-$L4  -$B3   $top)
    ( $L3  -$B3   $top)
    ( $L3     0   $top)
    (-$L4     0   $top)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 16 15) simpleGrading (1 1 0.05)
    hex (4 5 6 7 8 9 10 11) (30 16 30) simpleGrading (1 1 0.2)
    hex (8 9 10 11 12 13 14 15) (30 16 8) simpleGrading (1 1 1)
    hex (12 13 14 15 16 17 18 19) (30 16 8) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) (30 16 30) simpleGrading (1 1 3)
    hex (20 21 22 23 24 25 26 27) (30 16 10) simpleGrading (1 1 6)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (24 25 26 27)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
            (13 14 18 17)
            (17 18 22 21)
            (21 22 26 25)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            (8 12 15 11)
            (12 16 19 15)
            (16 20 23 19)
            (20 24 27 23)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    side
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
            (16 17 21 20)
            (20 21 25 24)
        );
    }
    midPlane
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
            (7 11 10 6)
            (11 15 14 10)
            (15 19 18 14)
            (19 23 22 18)
            (23 27 26 22)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
